### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

### groupby

<img src='https://www.w3resource.com/w3r_images/pandas-groupby-split-apply-combine.svg'>

- 데이터 그룹 연산 수행 단계
    - 원본 데이터 셋을 그룹별로 분할(split)
    - 분할된 각 그룹에 함수 적용
    - 결과 통합

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

### [실습1]

In [2]:
df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [4]:
df.groupby("origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [5]:
df['origin'].value_counts()

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

In [9]:
# origin 별로 평균값을 보고 싶다면?

df.groupby("origin").mean(numeric_only=True)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [10]:
# cylinders 값만 보고 싶다면?

df.groupby("origin")['cylinders'].mean(numeric_only=True)

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [13]:
# origin 별 cylinders 중간값 보기

df.groupby("origin")['cylinders'].median()

origin
europe    4.0
japan     4.0
usa       6.0
Name: cylinders, dtype: float64

In [14]:
# 그룹을 여러개 설정

df.groupby(["model_year","origin"])['cylinders'].mean()

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

### [실습2]

In [15]:
df = pd.DataFrame({
    "A":['ha','hi','ho','ha','ho'],
    "B":['one','two','one','one','two'],
    "Data1":np.random.randn(5),
    "Data2":np.random.randn(5),
})

df

    A    B     Data1     Data2
0  ha  one  0.144451  0.552155
1  hi  two  0.574655 -0.991855
2  ho  one  0.115082 -0.027018
3  ha  one -1.781842 -0.329502
4  ho  two  1.221966  0.440327

In [28]:
df.groupby('A').sum(numeric_only=True)

       Data1     Data2
A
ha -1.637391  0.222653
hi  0.574655 -0.991855
ho  1.337048  0.413309

In [18]:
df.groupby('B').mean(numeric_only=True)

        Data1     Data2
B
one -0.507436  0.065212
two  0.898311 -0.275764

- agg() : 여러 개의 함수를 넣을 수도 혹은 하나의 함수만 넣을 수도 있음

In [30]:
# df.groupby('A')[['Data1','Data2']].agg([np.sum, np.mean, np.std])
df.groupby('A')[['Data1','Data2']].agg(["sum", "mean", "std"])

       Data1                         Data2
         sum      mean       std       sum      mean       std
A
ha -1.637391 -0.818695  1.362095  0.222653  0.111327  0.623426
hi  0.574655  0.574655       NaN -0.991855 -0.991855       NaN
ho  1.337048  0.668524  0.782686  0.413309  0.206654  0.330463

In [31]:
df.groupby('A')['Data1'].aggregate(["sum","mean","std"])

         sum      mean       std
A
ha -1.637391 -0.818695  1.362095
hi  0.574655  0.574655       NaN
ho  1.337048  0.668524  0.782686

In [32]:
df.groupby('A')['Data1'].aggregate(["sum","mean","std"]).rename(columns={"sum":"합계","mean":"평균","std":"표준편차"})

          합계        평균      표준편차
A
ha -1.637391 -0.818695  1.362095
hi  0.574655  0.574655       NaN
ho  1.337048  0.668524  0.782686

### [실습3]

In [34]:
df = pd.DataFrame({
    "name":["John","Nate","Abraham","Brian","Janny","Yuna","Jeniffer","Edward","Zara","Wendy","Sera"],
    "major":["Computer Science","Computer Science", "Physics", "Psychology", "Economics", "Economics","Computer Science", "Computer Science", "Psychology", "Economics", "Psychology"],
    "gender":["male","male","male","male","female","female","female","male","female","female","female"]
})
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [36]:
# major 그룹 => size(), 인덱스 해제

df.groupby('major').size().reset_index()

              major  0
0  Computer Science  4
1         Economics  3
2           Physics  1
3        Psychology  3

In [37]:
# 학과별로 몇 명이 있는지 알고 싶다면?

groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [38]:
for name, group in groupby_major:
    print(name + ":" + str(len(group)))

Computer Science:4
Economics:3
Physics:1
Psychology:3

In [42]:
# 학과별로 데이터프레임 생성하고 싶다면?

df_major = pd.DataFrame({'count':df.groupby('major').size()})
df_major

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [ ]:
# major 을 column 으로 설정

df_major.reset_index()

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [45]:
# 성별로 그룹화 하기

groupby_gender = df.groupby('gender')
groupby_gender.groups

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

In [46]:
for name, group in groupby_gender:
    print(name + ":" + str(len(group)))
    print(group)

female:6
        name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
male:5
      name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male

### [실습]

In [48]:
import pandas as pd

In [53]:
# 자동차 대리점의 판매 차종, 판매 수량, 단가, 총 판매가
# car_sales.xlsx

car_df = pd.read_excel("../analytics/data/car_sales.xlsx")

car_df

    Branch  Car Name  Quantity  Unit Price  Ext Price
0  Yeonnam  Grandeur         7          35        245
1  Yeonnam    Sonata        11          20        220
2  Yeonnam    Avante         3          15         45
3  Sungsan  Grandeur         5          36        180
4  Sungsan    Sonata        19          19        361
5  Sungsan    Avante         9          14        126
6   Yeonhi  Grandeur        10          34        340
7   Yeonhi    Sonata        13          19        247
8   Yeonhi    Avante        15          13        195

In [65]:
# 3개 대리점에서 판매된 매출액 구하기

branch_df = car_df.groupby('Branch')['Ext Price'].sum()
branch_df

Branch
Sungsan    667
Yeonhi     782
Yeonnam    510
Name: Ext Price, dtype: int64

#### 결과를 데이터프레임으로 생성

#### [방법1]

In [66]:
branch_df

Branch
Sungsan    667
Yeonhi     782
Yeonnam    510
Name: Ext Price, dtype: int64

#### [방법2]

In [67]:
branch_df = branch_df.rename("Br_Total").reset_index()
branch_df

    Branch  Br_Total
0  Sungsan       667
1   Yeonhi       782
2  Yeonnam       510

In [54]:
car_df

    Branch  Car Name  Quantity  Unit Price  Ext Price
0  Yeonnam  Grandeur         7          35        245
1  Yeonnam    Sonata        11          20        220
2  Yeonnam    Avante         3          15         45
3  Sungsan  Grandeur         5          36        180
4  Sungsan    Sonata        19          19        361
5  Sungsan    Avante         9          14        126
6   Yeonhi  Grandeur        10          34        340
7   Yeonhi    Sonata        13          19        247
8   Yeonhi    Avante        15          13        195

In [68]:
car_df.merge(branch_df)

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total
0  Yeonnam  Grandeur         7          35        245       510
1  Yeonnam    Sonata        11          20        220       510
2  Yeonnam    Avante         3          15         45       510
3  Sungsan  Grandeur         5          36        180       667
4  Sungsan    Sonata        19          19        361       667
5  Sungsan    Avante         9          14        126       667
6   Yeonhi  Grandeur        10          34        340       782
7   Yeonhi    Sonata        13          19        247       782
8   Yeonhi    Avante        15          13        195       782

In [69]:
merge_df = car_df.merge(branch_df)
merge_df

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total
0  Yeonnam  Grandeur         7          35        245       510
1  Yeonnam    Sonata        11          20        220       510
2  Yeonnam    Avante         3          15         45       510
3  Sungsan  Grandeur         5          36        180       667
4  Sungsan    Sonata        19          19        361       667
5  Sungsan    Avante         9          14        126       667
6   Yeonhi  Grandeur        10          34        340       782
7   Yeonhi    Sonata        13          19        247       782
8   Yeonhi    Avante        15          13        195       782

In [71]:
merge_df['Br_Pct'] = merge_df['Ext Price'] / merge_df['Br_Total'] * 100
merge_df

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total     Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  48.039216
1  Yeonnam    Sonata        11          20        220       510  43.137255
2  Yeonnam    Avante         3          15         45       510   8.823529
3  Sungsan  Grandeur         5          36        180       667  26.986507
4  Sungsan    Sonata        19          19        361       667  54.122939
5  Sungsan    Avante         9          14        126       667  18.890555
6   Yeonhi  Grandeur        10          34        340       782  43.478261
7   Yeonhi    Sonata        13          19        247       782  31.585678
8   Yeonhi    Avante        15          13        195       782  24.936061

### transform()

In [ ]:
car_df.groupby('Branch')['Ext Price'].transform('sum')

0    510
1    510
2    510
3    667
4    667
5    667
6    782
7    782
8    782
Name: Ext Price, dtype: int64

In [74]:
car_df['Br_Total'] = car_df.groupby('Branch')['Ext Price'].transform('sum')
car_df['Br_Pct'] = car_df['Ext Price'] / car_df['Br_Total'] * 100
car_df

    Branch  Car Name  Quantity  Unit Price  Ext Price  Br_Total     Br_Pct
0  Yeonnam  Grandeur         7          35        245       510  48.039216
1  Yeonnam    Sonata        11          20        220       510  43.137255
2  Yeonnam    Avante         3          15         45       510   8.823529
3  Sungsan  Grandeur         5          36        180       667  26.986507
4  Sungsan    Sonata        19          19        361       667  54.122939
5  Sungsan    Avante         9          14        126       667  18.890555
6   Yeonhi  Grandeur        10          34        340       782  43.478261
7   Yeonhi    Sonata        13          19        247       782  31.585678
8   Yeonhi    Avante        15          13        195       782  24.936061

### 실습

In [75]:
df = pd.DataFrame({
    "School":["Yeonhi","Yeonhi","Sungsan","Sungsan","Sungsan"],
    "Name":["Haena","Gisu", "Una", "Naeun", "Ziho"],
    "Math_s":[92,70,88,92,70]
})
df

    School   Name  Math_s
0   Yeonhi  Haena      92
1   Yeonhi   Gisu      70
2  Sungsan    Una      88
3  Sungsan  Naeun      92
4  Sungsan   Ziho      70

In [77]:
# school을 그룹으로 하여 수학 성적의 평균 구하기

school_df = df.groupby('School')['Math_s'].mean()
school_df

school_df = school_df.rename("Avg_s").reset_index()
school_df

    School      Avg_s
0  Sungsan  83.333333
1   Yeonhi  81.000000

In [78]:
merge_df = df.merge(school_df)
merge_df

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

- transform() 을 사용시

In [81]:
df.groupby('School')['Math_s'].transform('mean')

df['Avg_s'] = df.groupby('School')['Math_s'].transform('mean')
df

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

- apply() : apply(적용할함수)

In [ ]:
# 함수 정의 : 등급 리턴
# 90 이상 : A, 80 이상 : B, 70 이상 : C, F

In [82]:
def grade(num):
    if num >= 90:
        grade = 'A'
    elif num >= 80:
        grade = 'B'
    elif num >= 70:
        grade = 'C'
    else:
        grade = 'F'
    return grade

In [83]:
df['grade'] = df['Math_s'].apply(grade)
df

    School   Name  Math_s      Avg_s grade
0   Yeonhi  Haena      92  81.000000     A
1   Yeonhi   Gisu      70  81.000000     C
2  Sungsan    Una      88  83.333333     B
3  Sungsan  Naeun      92  83.333333     A
4  Sungsan   Ziho      70  83.333333     C

In [ ]:
df_m.groupby('School').apply(sort_math,n=2)

            School   Name  Math_s      Avg_s grade
School
Sungsan 4  Sungsan   Ziho      70  83.333333     F
        2  Sungsan    Una      88  83.333333     B
Yeonhi  1   Yeonhi   Gisu      70  81.000000     F
        0   Yeonhi  Haena      92  81.000000     A